Tekla Open API Reference for Tekla Structures 2025
TeklaDrawingColor.RGBColor Property
 Red, Green, Blue representation of the color.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Color RGBColor { get; }
Public ReadOnly Property RGBColor As Color
	Get
Property Value
Type: Color
See Also
Reference
TeklaDrawingColor Structure
Tekla.Structures.Drawing Namespace